{
  "title": "1 - A ferramenta que você precisava (Apidog)",
  "tags": ["TI", "TOOLS"],
  "images": [null],
  "text": [
    "De acordo com a definição do modelo de API, vários códigos de negócios (como Model, Controller, códigos de teste de unidade, etc.) e códigos de solicitação de API para diferentes linguagens/frameworks (como TypeScript, Java, Go, Swift, ObjectiveC, Kotlin, Dart, C++, C#, Rust, etc.) são gerados automaticamente. Atualmente, o Apidog suporta a geração de código para 130 linguagens e frameworks.",
    "Mais importante, você pode gerar código que esteja em conformidade com os padrões de arquitetura da sua equipe e atenda a vários requisitos personalizados por meio de modelos de código personalizados.",
    "Scripts personalizados suportam a execução de vários códigos de linguagem, como javascript, java, python, php, js, BeanShell, go, shell, ruby, lua e muito mais.",
    "No desenvolvimento atual de aplicações Web, é necessário o uso de diversas tecnologias; como linguagens de programação, bibliotecas e frameworks. Mas com aplicações se escalando cada vez mais, é necessário fazer diversos tipos de testes, para que possamos ter certeza de que tudo está funcionando dentro dos conformes.",
    "Para auxiliarmos em nossos diversos tipos de testes, usamos mais uma vez a tecnologia para nós auxiliar. Com API’s ficando cada vez mais complexas, o Postman nos auxilia no processo de testar diversas rotas.",
    "Para simularmos dados sensíveis usamos a técnica de Mock. ",
    "Se uma aplicação escala chega em um determinado momento, que fica inviável entender tudo que está acontecendo e para que serve, e com isso é necessário documentar. Hoje temos uma tecnologia incrível que nos auxilia muito em documentar API’s, que é o Swagger. ",
    "Além dos famosos logs para nos informar de tudo que vem acontecendo é importante entender se a nossa aplicação consegue atender mais ou menos requisições, e caso ocorra algum surto, será que a aplicação aguentará? É necessário entender até que ponto a aplicação suporta, e isso precisa ser testado o mais rápido possível, antes de ir para a produção.  Existe uma aplicação feita em Java chamada de JMeter que nos auxilia para fazer testes de carga e de estresse, nos auxiliando ainda mais a entender as limitações da nossa aplicação, nos auxiliando a evoluí-la da melhor maneira.",
    "Agora Imagine tudo isso em uma ferramenta só? Pois é, isso pode ser útil, já que tudo vai estar de certa forma integrada; e esse programinha se chama Apidog. ",
    "Apidog consegue disponibilizar um workspace bastante integrado e com um UI/UX muito consistente, sendo bom para os olhos. Caso o projeto que você esteja no momento não há necessidade de ter uma tool dessa para te auxiliar ainda vale a pena dar uma testada, porque no fim tem um Postman lá dentro, e te traz uma experiência um pouco diferente da UX do Postman.",
    "Um disclaimer, ele não é uma tool open source, mas tem um plano free, caso você tenha uma visão de mundo de só usar tools open source, fique longe do Apidog.",
    "Algumas features que o Apidog traz:",
    "De acordo com a definição do modelo de API, o Apidog é capaz de gerar automaticamente vários códigos de negócios, como Model, Controller, códigos de teste de unidade, etc., e códigos de solicitação de API para diferentes linguagens/frameworks, como TypeScript, Java, Go, Swift, ObjectiveC, Kotlin, Dart, C++, C#, Rust e outras. Atualmente, o Apidog suporta a geração de código para 130 linguagens e frameworks. Além disso, você pode gerar código que esteja em conformidade com os padrões de arquitetura da sua equipe e atenda a vários requisitos personalizados por meio de modelos de código personalizados. Scripts personalizados suportam a execução de vários códigos de linguagem, como javascript, java, python, php, js, BeanShell, go, shell, ruby e lua.",
    "Suporta sincronização na nuvem; sendo possível compartilhar recursos de forma prática.",
    "O Apidog suporta a exportação de formatos de dados como OpenApi (Swagger), Markdown, Html, entre outros. Isso permite que os desenvolvedores exportem dados no formato OpenApi e usem as ferramentas avançadas do OpenApi (Swagger) para realizar várias tarefas relacionadas à API. Além disso, o Apidog suporta a importação de vários formatos, como OpenApi (Swagger), Postman, apiDoc, HAR, RAML, I/O Doc, WADL e Google Discovery. Isso é muito conveniente para a migração de projetos. O Apidog também suporta a importação automatizada de dados nos formatos OpenApi (Swagger), apiDoc e Apidog.",
    "Para saber mais visite a página do Apidog."
  ]
}
